In [1]:
import pandas as pd
import numpy as np

In [2]:
data = [1,2,3,4]
df = pd.DataFrame(data)
df#pd.Series

   0
0  1
1  2
2  3
3  4

In [3]:
df["A"] = data

In [4]:
df

   0  A
0  1  1
1  2  2
2  3  3
3  4  4

In [5]:
df["B"] = data

In [6]:
df

   0  A  B
0  1  1  1
1  2  2  2
2  3  3  3
3  4  4  4

In [7]:
df["newCol2"] = df["B"]
df["newCol3"] = df["newCol2"] *100
df

   0  A  B  newCol2  newCol3
0  1  1  1        1      100
1  2  2  2        2      200
2  3  3  3        3      300
3  4  4  4        4      400

In [8]:
df["newCol2"][1] = 2000
df

   0  A  B  newCol2  newCol3
0  1  1  1        1      100
1  2  2  2     2000      200
2  3  3  3        3      300
3  4  4  4        4      400

In [9]:
df.drop("newCol2", axis =1)

   0  A  B  newCol3
0  1  1  1      100
1  2  2  2      200
2  3  3  3      300
3  4  4  4      400

In [10]:
df.drop(3,axis=0)

   0  A  B  newCol2  newCol3
0  1  1  1        1      100
1  2  2  2     2000      200
2  3  3  3        3      300

In [11]:
df.index.name ="count"
df

       0  A  B  newCol2  newCol3
count
0      1  1  1        1      100
1      2  2  2     2000      200
2      3  3  3        3      300
3      4  4  4        4      400

In [12]:
kakao_priceDF = pd.DataFrame([274500,274500,282500],index=["2020-06-26","2020-06-25","2020-06-24"])
kakao_priceDF

                 0
2020-06-26  274500
2020-06-25  274500
2020-06-24  282500

In [13]:
k_DF= kakao_priceDF

In [14]:
k_DF["2020-06-23"] = 281500

In [15]:
k_DF.drop("2020-06-23",axis=1, inplace = True)

In [16]:
k_DF.rename(columns = {0:"종가"},inplace = True)
k_DF

                종가
2020-06-26  274500
2020-06-25  274500
2020-06-24  282500

In [17]:
k_DF.loc["2020-06-23",:] = [281500]

In [18]:
k_DF = pd.DataFrame([274500,274500,282500,281500,274000],index=["2020-06-26","2020-06-25","2020-06-24","2020-06-23","2020-06-22"])

In [19]:
k_DF.rename({0:"종가"},axis = 1,inplace = True)

In [20]:
k_DF["시가"] =[100000,200000,100000,200000,100000]

In [21]:
k_DF

                종가      시가
2020-06-26  274500  100000
2020-06-25  274500  200000
2020-06-24  282500  100000
2020-06-23  281500  200000
2020-06-22  274000  100000

In [22]:
k_DF.loc[["2020-06-26","2020-06-24"],"종가"]

2020-06-26    274500
2020-06-24    282500
Name: 종가, dtype: int64

In [23]:
k_DF.values

array([[274500, 100000],
       [274500, 200000],
       [282500, 100000],
       [281500, 200000],
       [274000, 100000]], dtype=int64)

In [24]:
k_DF.shape

(5, 2)

In [25]:
k_DF.shape[0]

5

In [26]:
obj = pd.Series([4.5,7.2,-5.3], index=["c","b","a"])
obj

c    4.5
b    7.2
a   -5.3
dtype: float64

In [27]:
obj.reindex(["a","d","e","c","b"]).interpolate()

a   -5.300000
d   -2.033333
e    1.233333
c    4.500000
b    7.200000
dtype: float64

In [28]:
obj

c    4.5
b    7.2
a   -5.3
dtype: float64

In [29]:
obj.reindex(["a","b","d","e","c"],fill_value =99)

a    -5.3
b     7.2
d    99.0
e    99.0
c     4.5
dtype: float64

In [30]:
k_DF

                종가      시가
2020-06-26  274500  100000
2020-06-25  274500  200000
2020-06-24  282500  100000
2020-06-23  281500  200000
2020-06-22  274000  100000

In [31]:
k_DF.sort_index(ascending = True).sort_values(by=["종가"],ascending=False)

                종가      시가
2020-06-24  282500  100000
2020-06-23  281500  200000
2020-06-25  274500  200000
2020-06-26  274500  100000
2020-06-22  274000  100000

In [32]:
k_DF

                종가      시가
2020-06-26  274500  100000
2020-06-25  274500  200000
2020-06-24  282500  100000
2020-06-23  281500  200000
2020-06-22  274000  100000

In [33]:
k_DF.sort_index(ascending =True)

                종가      시가
2020-06-22  274000  100000
2020-06-23  281500  200000
2020-06-24  282500  100000
2020-06-25  274500  200000
2020-06-26  274500  100000

In [34]:
k_DF.sort_values(by=["종가"],ascending = False).head()

                종가      시가
2020-06-24  282500  100000
2020-06-23  281500  200000
2020-06-26  274500  100000
2020-06-25  274500  200000
2020-06-22  274000  100000

In [35]:
k_DF.sort_values(by=["종가"],ascending = True)

                종가      시가
2020-06-22  274000  100000
2020-06-26  274500  100000
2020-06-25  274500  200000
2020-06-23  281500  200000
2020-06-24  282500  100000

In [36]:
k_DF["고가"] = [310000,325000,250000,241000,260000]

In [37]:
k_DF

                종가      시가      고가
2020-06-26  274500  100000  310000
2020-06-25  274500  200000  325000
2020-06-24  282500  100000  250000
2020-06-23  281500  200000  241000
2020-06-22  274000  100000  260000

In [38]:
k_DF=k_DF.applymap(lambda x: x+1000)

In [39]:
k_DF

                종가      시가      고가
2020-06-26  275500  101000  311000
2020-06-25  275500  201000  326000
2020-06-24  283500  101000  251000
2020-06-23  282500  201000  242000
2020-06-22  275000  101000  261000

In [40]:
k_DF.apply(lambda x : x.mean(),axis=0)

종가    278400.0
시가    141000.0
고가    278200.0
dtype: float64

In [41]:
stock_price_DF_withIndex = pd.DataFrame([10000, 10300, 9900, 10500, 11000], 
    index = ["2020-03-01","2020-03-02","2020-03-03","2020-03-04","2020-03-5"])
stock_price_DF_withIndex.rename(columns = {0 : "시가"}, inplace=True)

stock_price_DF_withIndex["종가"] = [350,234,234000,13000,12000]
stock_price_DF_withIndex["고가"] = [13000,15000,15000,122000,17000]
stock_price_DF_withIndex["저가"] = [3000,5000,5000,8000,7000]

stock_price_DF_withIndex
df = stock_price_DF_withIndex

In [42]:
df

               시가      종가      고가    저가
2020-03-01  10000     350   13000  3000
2020-03-02  10300     234   15000  5000
2020-03-03   9900  234000   15000  5000
2020-03-04  10500   13000  122000  8000
2020-03-5   11000   12000   17000  7000

In [43]:
df["Gap"] = df.apply(lambda x: x.max()-x.min(),axis=1)

In [44]:
df

               시가      종가      고가    저가     Gap
2020-03-01  10000     350   13000  3000   12650
2020-03-02  10300     234   15000  5000   14766
2020-03-03   9900  234000   15000  5000  229000
2020-03-04  10500   13000  122000  8000  114000
2020-03-5   11000   12000   17000  7000   10000

In [45]:
df["Gap_forLoop"] = 0
df

               시가      종가      고가    저가     Gap  Gap_forLoop
2020-03-01  10000     350   13000  3000   12650            0
2020-03-02  10300     234   15000  5000   14766            0
2020-03-03   9900  234000   15000  5000  229000            0
2020-03-04  10500   13000  122000  8000  114000            0
2020-03-5   11000   12000   17000  7000   10000            0

In [46]:
df.loc["2020-03-01",:]


for i in range(len(df)):
    temp = df.iloc[i,0:4]
    df.iat[i,df.columns.get_loc("Gap_forLoop")]= temp.max() - temp.min()
    

df

               시가      종가      고가    저가     Gap  Gap_forLoop
2020-03-01  10000     350   13000  3000   12650        12650
2020-03-02  10300     234   15000  5000   14766        14766
2020-03-03   9900  234000   15000  5000  229000       229000
2020-03-04  10500   13000  122000  8000  114000       114000
2020-03-5   11000   12000   17000  7000   10000        10000

In [47]:
labels = ["시가","종가","고가"]
labels_idx = [df.columns.get_loc(i) for i in labels]
labels_idx

[0, 1, 2]

In [48]:
for i in df.index:
    temp=df.loc[i,["시가","종가","저가","고가"]]
    gap = temp.max() - temp.min()
    df.at[i,"Gap_forLoop"] = gap
df

               시가      종가      고가    저가     Gap  Gap_forLoop
2020-03-01  10000     350   13000  3000   12650        12650
2020-03-02  10300     234   15000  5000   14766        14766
2020-03-03   9900  234000   15000  5000  229000       229000
2020-03-04  10500   13000  122000  8000  114000       114000
2020-03-5   11000   12000   17000  7000   10000        10000

In [49]:
for i in df.index:
    temp = df.loc[i,"시가":"Gap"].mean()
    df.at[i,"Mean"] = temp
df

               시가      종가      고가    저가     Gap  Gap_forLoop     Mean
2020-03-01  10000     350   13000  3000   12650        12650   7800.0
2020-03-02  10300     234   15000  5000   14766        14766   9060.0
2020-03-03   9900  234000   15000  5000  229000       229000  98580.0
2020-03-04  10500   13000  122000  8000  114000       114000  53500.0
2020-03-5   11000   12000   17000  7000   10000        10000  11400.0

#### 칼럼삭제하기

In [50]:
del df["Mean"]

In [51]:
df

               시가      종가      고가    저가     Gap  Gap_forLoop
2020-03-01  10000     350   13000  3000   12650        12650
2020-03-02  10300     234   15000  5000   14766        14766
2020-03-03   9900  234000   15000  5000  229000       229000
2020-03-04  10500   13000  122000  8000  114000       114000
2020-03-5   11000   12000   17000  7000   10000        10000

In [52]:
df.drop("Gap_forLoop",axis = 1, inplace = True)

In [53]:
df

               시가      종가      고가    저가     Gap
2020-03-01  10000     350   13000  3000   12650
2020-03-02  10300     234   15000  5000   14766
2020-03-03   9900  234000   15000  5000  229000
2020-03-04  10500   13000  122000  8000  114000
2020-03-5   11000   12000   17000  7000   10000

In [54]:
df.rename(columns ={"Gap":"차이"},inplace = True)

In [55]:
df

               시가      종가      고가    저가      차이
2020-03-01  10000     350   13000  3000   12650
2020-03-02  10300     234   15000  5000   14766
2020-03-03   9900  234000   15000  5000  229000
2020-03-04  10500   13000  122000  8000  114000
2020-03-5   11000   12000   17000  7000   10000

In [56]:
df

               시가      종가      고가    저가      차이
2020-03-01  10000     350   13000  3000   12650
2020-03-02  10300     234   15000  5000   14766
2020-03-03   9900  234000   15000  5000  229000
2020-03-04  10500   13000  122000  8000  114000
2020-03-5   11000   12000   17000  7000   10000

In [58]:
df.rename(columns={"차이":"차이값"}, inplace = True)
df

               시가      종가      고가    저가     차이값
2020-03-01  10000     350   13000  3000   12650
2020-03-02  10300     234   15000  5000   14766
2020-03-03   9900  234000   15000  5000  229000
2020-03-04  10500   13000  122000  8000  114000
2020-03-5   11000   12000   17000  7000   10000

In [60]:
newDf = pd.DataFrame([10000, 10300, 9900, 10500, 11000],index=["2016-03-01",
                                                              "2016-03-02","2016-03-03","2016-03-04","2016-03-5"])
newDf

                0
2016-03-01  10000
2016-03-02  10300
2016-03-03   9900
2016-03-04  10500
2016-03-5   11000

In [61]:
newDf.rename(columns ={0:"시가"},inplace = True)

In [62]:
newDf

               시가
2016-03-01  10000
2016-03-02  10300
2016-03-03   9900
2016-03-04  10500
2016-03-5   11000

In [63]:
newDf["종가"] = [11000,12000,10000,13000,12000]
newDf["고가"] = [13000,15000,15000,18000,17000]
newDf["저가"] = [3000,5000,5000,8000,7000]
newDf

               시가     종가     고가    저가
2016-03-01  10000  11000  13000  3000
2016-03-02  10300  12000  15000  5000
2016-03-03   9900  10000  15000  5000
2016-03-04  10500  13000  18000  8000
2016-03-5   11000  12000  17000  7000

In [64]:
newDf.rename(columns={"시가":"시가2","종가":"종가2"},inplace = True)

In [65]:
newDf

              시가2    종가2     고가    저가
2016-03-01  10000  11000  13000  3000
2016-03-02  10300  12000  15000  5000
2016-03-03   9900  10000  15000  5000
2016-03-04  10500  13000  18000  8000
2016-03-5   11000  12000  17000  7000

In [66]:
newDf.loc["2016-03-01",["시가2","종가2"]]

시가2    10000
종가2    11000
Name: 2016-03-01, dtype: int64

In [67]:
newDf.loc["2016-03-01":"2016-03-04",:]

              시가2    종가2     고가    저가
2016-03-01  10000  11000  13000  3000
2016-03-02  10300  12000  15000  5000
2016-03-03   9900  10000  15000  5000
2016-03-04  10500  13000  18000  8000

In [68]:
newDf["시가2"]

2016-03-01    10000
2016-03-02    10300
2016-03-03     9900
2016-03-04    10500
2016-03-5     11000
Name: 시가2, dtype: int64

In [69]:
newDf.T

     2016-03-01  2016-03-02  2016-03-03  2016-03-04  2016-03-5
시가2       10000       10300        9900       10500      11000
종가2       11000       12000       10000       13000      12000
고가        13000       15000       15000       18000      17000
저가         3000        5000        5000        8000       7000

In [75]:
newDf.values[0][0]
newDf

              시가2    종가2     고가    저가
2016-03-01  10000  11000  13000  3000
2016-03-02  10300  12000  15000  5000
2016-03-03   9900  10000  15000  5000
2016-03-04  10500  13000  18000  8000
2016-03-5   11000  12000  17000  7000

In [84]:
print(newDf.values[0][0])
print(newDf.loc["2016-03-01","시가2"])
print(newDf.iloc[0,0])
print(newDf.iloc[0,newDf.columns.get_loc("시가2")])
print(newDf.iloc[newDf.index.get_loc("2016-03-01"),newDf.columns.get_loc("시가2")])

10000
10000
10000
10000
10000

#### interpolate

In [85]:
graph = pd.Series([1,None,3,None,5], index =[1,2,3,4,5])

In [86]:
graph

1    1.0
2    NaN
3    3.0
4    NaN
5    5.0
dtype: float64

In [87]:
graph.interpolate()

1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
dtype: float64

In [88]:
newDf

              시가2    종가2     고가    저가
2016-03-01  10000  11000  13000  3000
2016-03-02  10300  12000  15000  5000
2016-03-03   9900  10000  15000  5000
2016-03-04  10500  13000  18000  8000
2016-03-5   11000  12000  17000  7000

In [92]:
newDf.rename(columns={"시가2":"시가","종가2":"종가"},inplace = True)

In [93]:
newDf

               시가     종가     고가    저가
2016-03-01  10000  11000  13000  3000
2016-03-02  10300  12000  15000  5000
2016-03-03   9900  10000  15000  5000
2016-03-04  10500  13000  18000  8000
2016-03-5   11000  12000  17000  7000

In [94]:
print(newDf)

               시가     종가     고가    저가
2016-03-01  10000  11000  13000  3000
2016-03-02  10300  12000  15000  5000
2016-03-03   9900  10000  15000  5000
2016-03-04  10500  13000  18000  8000
2016-03-5   11000  12000  17000  7000

In [98]:
print(newDf.sort_index(axis = 0))
(newDf.sort_index(axis = 1))

               시가     종가     고가    저가
2016-03-01  10000  11000  13000  3000
2016-03-02  10300  12000  15000  5000
2016-03-03   9900  10000  15000  5000
2016-03-04  10500  13000  18000  8000
2016-03-5   11000  12000  17000  7000

               고가     시가    저가     종가
2016-03-01  13000  10000  3000  11000
2016-03-02  15000  10300  5000  12000
2016-03-03  15000   9900  5000  10000
2016-03-04  18000  10500  8000  13000
2016-03-5   17000  11000  7000  12000

In [100]:
(newDf.sort_index(axis = 0))
print(newDf.sort_index(axis = 0, ascending = False))
print(newDf.sort_index(axis = 0, ascending = True))

               시가     종가     고가    저가
2016-03-5   11000  12000  17000  7000
2016-03-04  10500  13000  18000  8000
2016-03-03   9900  10000  15000  5000
2016-03-02  10300  12000  15000  5000
2016-03-01  10000  11000  13000  3000
               시가     종가     고가    저가
2016-03-01  10000  11000  13000  3000
2016-03-02  10300  12000  15000  5000
2016-03-03   9900  10000  15000  5000
2016-03-04  10500  13000  18000  8000
2016-03-5   11000  12000  17000  7000

In [102]:
print(newDf.sort_index(axis=1,ascending = True))
print(newDf.sort_index(axis=1,ascending = False))

               고가     시가    저가     종가
2016-03-01  13000  10000  3000  11000
2016-03-02  15000  10300  5000  12000
2016-03-03  15000   9900  5000  10000
2016-03-04  18000  10500  8000  13000
2016-03-5   17000  11000  7000  12000
               종가    저가     시가     고가
2016-03-01  11000  3000  10000  13000
2016-03-02  12000  5000  10300  15000
2016-03-03  10000  5000   9900  15000
2016-03-04  13000  8000  10500  18000
2016-03-5   12000  7000  11000  17000

In [104]:
graph = pd.DataFrame([1,2,3,4,5],index=["A","B","C","D","E"])
graph[1] = graph[0] *10
graph[2] = graph[1] *10

In [105]:
graph

   0   1    2
A  1  10  100
B  2  20  200
C  3  30  300
D  4  40  400
E  5  50  500

In [108]:
graph[3] = graph.apply(lambda x: x.mean(),axis = 1)
graph

   0   1    2      3
A  1  10  100   37.0
B  2  20  200   74.0
C  3  30  300  111.0
D  4  40  400  148.0
E  5  50  500  185.0

In [111]:
graph.sort_index(ascending = False)

   0   1    2      3
E  5  50  500  185.0
D  4  40  400  148.0
C  3  30  300  111.0
B  2  20  200   74.0
A  1  10  100   37.0

In [116]:
graph.sort_values(by=[0],ascending = False)

   0   1    2      3
E  5  50  500  185.0
D  4  40  400  148.0
C  3  30  300  111.0
B  2  20  200   74.0
A  1  10  100   37.0

In [117]:
graph

   0   1    2      3
A  1  10  100   37.0
B  2  20  200   74.0
C  3  30  300  111.0
D  4  40  400  148.0
E  5  50  500  185.0

In [120]:
graph.sort_index(axis = 0, ascending = False)

   0   1    2      3
E  5  50  500  185.0
D  4  40  400  148.0
C  3  30  300  111.0
B  2  20  200   74.0
A  1  10  100   37.0

In [121]:
newDf

               시가     종가     고가    저가
2016-03-01  10000  11000  13000  3000
2016-03-02  10300  12000  15000  5000
2016-03-03   9900  10000  15000  5000
2016-03-04  10500  13000  18000  8000
2016-03-5   11000  12000  17000  7000

In [128]:
d_Df= newDf.sort_values(by=["종가"],ascending =False)
d_Df.drop("시가",axis = 1)
d_Df

               시가     종가     고가    저가
2016-03-04  10500  13000  18000  8000
2016-03-02  10300  12000  15000  5000
2016-03-5   11000  12000  17000  7000
2016-03-01  10000  11000  13000  3000
2016-03-03   9900  10000  15000  5000

In [129]:
newDf.index.is_unique

True

In [130]:
np.arange(12)

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11])

In [131]:
np.arange(12).reshape(3,4)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [136]:
df1 = pd.DataFrame(np.arange(12).reshape((3,4)),columns = list("abcd"))
df2 = pd.DataFrame(np.arange(20).reshape((4,5)),columns= list("abcde"))
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [137]:
df1.add(df2, fill_value = 100)

       a      b      c      d      e
0    0.0    2.0    4.0    6.0  104.0
1    9.0   11.0   13.0   15.0  109.0
2   18.0   20.0   22.0   24.0  114.0
3  115.0  116.0  117.0  118.0  119.0

In [138]:
newDf

               시가     종가     고가    저가
2016-03-01  10000  11000  13000  3000
2016-03-02  10300  12000  15000  5000
2016-03-03   9900  10000  15000  5000
2016-03-04  10500  13000  18000  8000
2016-03-5   11000  12000  17000  7000

In [139]:
newDf.apply(lambda x: x.max()-x.min(),axis =1)

2016-03-01    10000
2016-03-02    10000
2016-03-03    10000
2016-03-04    10000
2016-03-5     10000
dtype: int64

In [140]:
newDf["차이값"] =newDf.apply(lambda x: x.max()-x.min(),axis =1)
newDf

               시가     종가     고가    저가    차이값
2016-03-01  10000  11000  13000  3000  10000
2016-03-02  10300  12000  15000  5000  10000
2016-03-03   9900  10000  15000  5000  10000
2016-03-04  10500  13000  18000  8000  10000
2016-03-5   11000  12000  17000  7000  10000

In [141]:
newDf["차이값2"] = 0
for i in newDf.index:
    temp = newDf.loc[i,["시가","종가","고가","저가"]]
    gap=temp.max()-temp.min()
    newDf.at[i,"차이값2"] = gap
newDf

               시가     종가     고가    저가    차이값   차이값2
2016-03-01  10000  11000  13000  3000  10000  10000
2016-03-02  10300  12000  15000  5000  10000  10000
2016-03-03   9900  10000  15000  5000  10000  10000
2016-03-04  10500  13000  18000  8000  10000  10000
2016-03-5   11000  12000  17000  7000  10000  10000

In [143]:
del newDf["차이값2"]

In [144]:
newDf

               시가     종가     고가    저가    차이값
2016-03-01  10000  11000  13000  3000  10000
2016-03-02  10300  12000  15000  5000  10000
2016-03-03   9900  10000  15000  5000  10000
2016-03-04  10500  13000  18000  8000  10000
2016-03-5   11000  12000  17000  7000  10000

In [146]:
newDf.apply(lambda x: x.mean(),axis=1)

2016-03-01     9400.0
2016-03-02    10460.0
2016-03-03     9980.0
2016-03-04    11900.0
2016-03-5     11400.0
dtype: float64